"""
작성일: 2020-08-30
==============================================================================
문제: 효율적인 화폐 구성
N가지 종류의 화폐가 있다.
이 화폐들의 개수를 최소한으로 이용해서 그 가치의 합이 M원이 되도록 하려고 한다.
각 화폐는 몇 개라도 사용할 수 있으며, 사용한 화폐의 구성은 같지만 순서만 다른 것은 같은 경우로 구분한다.
경우의 수를 구하여라
==============================================================================
소요 시간: 00분
"""

"""
접근법:   
==============================================================================
다른 해결 방식: 다른 해결 방법
==============================================================================
개선점: 개선할 수 있는 부분
==============================================================================
노트: 
결과를 어떤 수로 나눈 결과를 출력하라 => 결과값이 굉장히 커질 수 있기 때문 
=> 값을 계산할 때마다 특정한 수로 나눈 나머지만 취하도록 하면 된다.
"""